In [1]:
###Import Module
import pandas as pd

print(pd.__version__)

1.2.4

In [2]:
###Persiapan Data Frame
data = {'col1':['1','2','3','teks'], ####didalam kurung siku itu merupakan data yang ada dalam colom1 maupun colom2
        'col2':['1','2','3','4']} ####col1 dan 2 akan menjadi nama colum

df = pd.DataFrame(data)####Membuat objek data frame yang datanya diambil dalam variabel data tersebut
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
df.dtypes ####Untuk memanggil tipe data apa yang terbentuk
####col1 dan col2 merupakan tipe data object karena tipe data yang diatas adalah berupa String

col1    object
col2    object
dtype: object

In [5]:
###Konversi Tipe Data
df_x = df.astype({'col2':'int'}) ###astype berfungsi untuk mengconversi tipe data, cth:col 2 tipe datanya akan diubah menjadi integer
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [6]:
df_x.dtypes ####Berfungsi untuk memanggil tipe data yang ada diubah pada astype tersebut

col1    object
col2     int32
dtype: object

In [8]:
###Konversi tipe data numerik
df.apply(pd.to_numeric, errors='coerce')####Fungsi to_numerik itu adalah untuk mengconversi menjadi data numerik dan menerapkannya kedalam data frame

####Parameter eror diberi nilai coerce, arti coerce adalah kalau andai kata dalam proses konversi tipe data numerik didapati suatu data yg tdk bsa dikonversi ke numerik maka data tersebut akan digantikan dengan NaN

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4